app/Controllers/AdminController.php

    public function dashboard() /**------- METHOD OF DASHBOARD --------*/
    {
        $register = new UserModel();
        $data['register'] = $register->findAll();
---
SELECT *
FROM `register`