app/Controllers/ProductController.php

SELECT *
FROM `design`
---
    public function design_list()
    {
        $designs = new DesignModel();
        $data['designs'] = $designs->findAll();