app/Controllers/Reservation.php

    public function booknow() /**------- BOOK NOW --------*/
    {
        $booking = new BookingModel();
        $data['booking'] = $booking->where('status', 'Approved')->findAll();
---
SELECT *
FROM `booking`
WHERE `status` = 'Approved'

    public function products() /**------- BOOK NOW --------*/
    {
        $products = new ProductModel();
        $data['products'] = $products->findAll();
---
SELECT *
FROM `products`

    public function reservation() /**------- BOOK NOW --------*/
    {
        $booking = new BookingModel();
        $data['booking'] = $booking->findAll();
---
SELECT *
FROM `booking`

    public function update($id)
    {
        $booking = new BookingModel();
        $books_list = $booking->find($id);

        $data = [
            'fullname' => $this->request->getPost('fullname'),
            'contact' => $this->request->getPost('contact'),
            'email' => $this->request->getPost('email'),
            'category' => $this->request->getPost('category'),
            'location' => $this->request->getPost('location'),
            'date' => $this->request->getPost('date'),
            'start' => $this->request->getPost('start'),
            'end' => $this->request->getPost('end'),
            'status' => $this->request->getPost('status')
        ];

        $booking->update($id, $data);
---
SELECT *
FROM `booking`
WHERE `booking`.`id` = '5'
UPDATE `booking` SET `fullname` = 'Sample Name', `contact` = '2147483647', `email` = 'sample@gmail.com', `category` = 'Wedding', `location` = 'Masipit Church', `date` = '2022-12-30', `start` = '10:00:00', `end` = '10:36:00', `status` = 'Approved'
WHERE `booking`.`id` IN ('5')